Autodesk.Revit.DB.Structure.StirrupTieAttachmentType
An enumerated tye that represents how the Stirrup/Tie rebar is attached to the cover reference.
Since:
2012

Autodesk.Revit.DB.Structure.StirrupTieAttachmentType.ExteriorFace
Designate Stirrup/Tie rebar to attach to exterior face of cover reference.

Autodesk.Revit.DB.Structure.StirrupTieAttachmentType.InteriorFace
Designate Stirrup/Tie rebar to attach to interior face of cover reference.